benchmarks/link_read/20_kb_read__150_latency_quic.log
20_kb_read: (g=0): rw=read, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process
20_kb_read: Laying out IO file (1 file / 0MiB)

20_kb_read: (groupid=0, jobs=1): err= 0: pid=12107: Mon Feb 17 02:04:02 2025
  read: IOPS=3, BW=1666B/s (1666B/s)(20.0KiB/12292msec)
    clat (usec): min=302660, max=304569, avg=303467.97, stdev=434.36
     lat (usec): min=302662, max=304571, avg=303469.90, stdev=434.51
    clat percentiles (msec):
     |  1.00th=[  305],  5.00th=[  305], 10.00th=[  305], 20.00th=[  305],
     | 30.00th=[  305], 40.00th=[  305], 50.00th=[  305], 60.00th=[  305],
     | 70.00th=[  305], 80.00th=[  305], 90.00th=[  305], 95.00th=[  305],
     | 99.00th=[  305], 99.50th=[  305], 99.90th=[  305], 99.95th=[  305],
     | 99.99th=[  305]
   bw (  KiB/s): min=    1, max=    2, per=61.46%, avg= 1.62, stdev= 0.49, samples=24
   iops        : min=    2, max=    4, avg= 3.25, stdev= 0.99, samples=24
  lat (msec)   : 500=100.00%
  cpu          : usr=0.02%, sys=0.00%, ctx=41, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=40,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1666B/s (1666B/s), 1666B/s-1666B/s (1666B/s-1666B/s), io=20.0KiB (20.5kB), run=12292-12292msec