benchmarks/link_read/20_kb_read__200_latency_quic.log
20_kb_read: (g=0): rw=read, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

20_kb_read: (groupid=0, jobs=1): err= 0: pid=12160: Mon Feb 17 02:04:38 2025
  read: IOPS=2, BW=1252B/s (1252B/s)(20.0KiB/16346msec)
    clat (usec): min=402749, max=404175, avg=403557.99, stdev=381.34
     lat (usec): min=402750, max=404178, avg=403559.99, stdev=381.55
    clat percentiles (msec):
     |  1.00th=[  405],  5.00th=[  405], 10.00th=[  405], 20.00th=[  405],
     | 30.00th=[  405], 40.00th=[  405], 50.00th=[  405], 60.00th=[  405],
     | 70.00th=[  405], 80.00th=[  405], 90.00th=[  405], 95.00th=[  405],
     | 99.00th=[  405], 99.50th=[  405], 99.90th=[  405], 99.95th=[  405],
     | 99.99th=[  405]
   bw (  KiB/s): min=    1, max=    2, per=81.79%, avg= 1.26, stdev= 0.44, samples=31
   iops        : min=    2, max=    4, avg= 2.52, stdev= 0.89, samples=31
  lat (msec)   : 500=100.00%
  cpu          : usr=0.00%, sys=0.02%, ctx=41, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=40,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1252B/s (1252B/s), 1252B/s-1252B/s (1252B/s-1252B/s), io=20.0KiB (20.5kB), run=16346-16346msec